In [1]:
!pip install pandas

Collecting pandas
  Using cached https://files.pythonhosted.org/packages/56/dd/9676967eac629273b2da40c53845f28d58af1800940d9b4067fc9a735dfb/pandas-1.3.4-cp38-cp38-macosx_10_9_x86_64.whl
Collecting pytz>=2017.3 (from pandas)
  Using cached https://files.pythonhosted.org/packages/d3/e3/d9f046b5d1c94a3aeab15f1f867aa414f8ee9d196fae6865f1d6a0ee1a0b/pytz-2021.3-py2.py3-none-any.whl
Requirement already satisfied: python-dateutil>=2.7.3 in /Users/uuboy.scy/PycharmProjects/TFI101/venv/lib/python3.8/site-packages (from pandas) (2.8.2)
Collecting numpy>=1.17.3; platform_machine != "aarch64" and platform_machine != "arm64" and python_version < "3.10" (from pandas)
  Downloading https://files.pythonhosted.org/packages/97/95/c3b2b3e5fcc641edf4711ff41797811b825899c52e673fc9364372c1d3e6/numpy-1.21.4-cp38-cp38-macosx_10_9_x86_64.whl (16.9MB)
    100% |████████████████████████████████| 16.9MB 745kB/s ta 0:00:011
Requirement already satisfied: six>=1.5 in /Users/uuboy.scy/PycharmProjects/TFI101/venv/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)
Installing collected packages: pytz, numpy, pandas
Successfully installed numpy-1.21.4 pandas-1.3.4 pytz-2021.3

In [2]:
import pandas as pd

df = pd.DataFrame(columns=['Name', 'Age', 'Height'])
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [3]:
df.loc[0] = ['Allen', '22', '175']

In [4]:
df

    Name Age Height
0  Allen  22    175

In [5]:
df.loc[1] = ['Ted', '25', '180']
df.loc[2] = ['Jack', '28', '170']

In [6]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  28    170

In [7]:
df['Name']

0    Allen
1      Ted
2     Jack
Name: Name, dtype: object

In [8]:
df['Weight'] = ['75', '80', '70']

In [9]:
df

    Name Age Height Weight
0  Allen  22    175     75
1    Ted  25    180     80
2   Jack  28    170     70

In [10]:
df.drop(['Weight'], axis=1)

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  28    170

In [11]:
df

    Name Age Height Weight
0  Allen  22    175     75
1    Ted  25    180     80
2   Jack  28    170     70

In [12]:
df = df.drop(['Weight'], axis=1)
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  28    170

In [13]:
df.drop(2)

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [14]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  28    170

In [15]:
df = df.drop(2)

In [16]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [17]:
df['Height'][1] = 185

In [18]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    185

In [19]:
df['Height'] = 180

In [20]:
df

    Name Age  Height
0  Allen  22     180
1    Ted  25     180

In [21]:
columns = ['Name', 'Age', 'Height']
data = [
    ['Allen', '22', '175'],
    ['Ted', '25', '180']
]

df2 = pd.DataFrame(data=data, columns=columns)

df2

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [22]:
df.append(df2)

    Name Age Height
0  Allen  22    180
1    Ted  25    180
0  Allen  22    175
1    Ted  25    180

In [23]:
df

    Name Age  Height
0  Allen  22     180
1    Ted  25     180

In [24]:
df = df.append(df2)

In [25]:
df

    Name Age Height
0  Allen  22    180
1    Ted  25    180
0  Allen  22    175
1    Ted  25    180

In [27]:
df.reset_index(drop=True)

    Name Age Height
0  Allen  22    180
1    Ted  25    180
2  Allen  22    175
3    Ted  25    180